MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/ssc.h
/* -------- SSC_TCMR : (SSC Offset: 0x18) (R/W 32) Transmit Clock Mode Register -------- */
#define SSC_TCMR_CKS_Pos                      _UINT32_(0)                                          /* (SSC_TCMR) Transmit Clock Selection Position */
#define SSC_TCMR_CKS_Msk                      (_UINT32_(0x3) << SSC_TCMR_CKS_Pos)                  /* (SSC_TCMR) Transmit Clock Selection Mask */
#define SSC_TCMR_CKS(value)                   (SSC_TCMR_CKS_Msk & (_UINT32_(value) << SSC_TCMR_CKS_Pos)) /* Assignment of value for CKS in the SSC_TCMR register */
#define   SSC_TCMR_CKS_MCK_Val                _UINT32_(0x0)                                        /* (SSC_TCMR) Divided Clock  */
#define   SSC_TCMR_CKS_RK_Val                 _UINT32_(0x1)                                        /* (SSC_TCMR) RK Clock signal  */
#define   SSC_TCMR_CKS_TK_Val                 _UINT32_(0x2)                                        /* (SSC_TCMR) TK pin  */
#define SSC_TCMR_CKS_MCK                      (SSC_TCMR_CKS_MCK_Val << SSC_TCMR_CKS_Pos)           /* (SSC_TCMR) Divided Clock Position */
#define SSC_TCMR_CKS_RK                       (SSC_TCMR_CKS_RK_Val << SSC_TCMR_CKS_Pos)            /* (SSC_TCMR) RK Clock signal Position */
#define SSC_TCMR_CKS_TK                       (SSC_TCMR_CKS_TK_Val << SSC_TCMR_CKS_Pos)            /* (SSC_TCMR) TK pin Position */
#define SSC_TCMR_CKO_Pos                      _UINT32_(2)                                          /* (SSC_TCMR) Transmit Clock Output Mode Selection Position */
#define SSC_TCMR_CKO_Msk                      (_UINT32_(0x7) << SSC_TCMR_CKO_Pos)                  /* (SSC_TCMR) Transmit Clock Output Mode Selection Mask */
#define SSC_TCMR_CKO(value)                   (SSC_TCMR_CKO_Msk & (_UINT32_(value) << SSC_TCMR_CKO_Pos)) /* Assignment of value for CKO in the SSC_TCMR register */
#define   SSC_TCMR_CKO_NONE_Val               _UINT32_(0x0)                                        /* (SSC_TCMR) None, TK pin is an input  */
#define   SSC_TCMR_CKO_CONTINUOUS_Val         _UINT32_(0x1)                                        /* (SSC_TCMR) Continuous Transmit Clock, TK pin is an output  */
#define   SSC_TCMR_CKO_TRANSFER_Val           _UINT32_(0x2)                                        /* (SSC_TCMR) Transmit Clock only during data transfers, TK pin is an output  */
#define SSC_TCMR_CKO_NONE                     (SSC_TCMR_CKO_NONE_Val << SSC_TCMR_CKO_Pos)          /* (SSC_TCMR) None, TK pin is an input Position */
#define SSC_TCMR_CKO_CONTINUOUS               (SSC_TCMR_CKO_CONTINUOUS_Val << SSC_TCMR_CKO_Pos)    /* (SSC_TCMR) Continuous Transmit Clock, TK pin is an output Position */
#define SSC_TCMR_CKO_TRANSFER                 (SSC_TCMR_CKO_TRANSFER_Val << SSC_TCMR_CKO_Pos)      /* (SSC_TCMR) Transmit Clock only during data transfers, TK pin is an output Position */
#define SSC_TCMR_CKI_Pos                      _UINT32_(5)                                          /* (SSC_TCMR) Transmit Clock Inversion Position */
#define SSC_TCMR_CKI_Msk                      (_UINT32_(0x1) << SSC_TCMR_CKI_Pos)                  /* (SSC_TCMR) Transmit Clock Inversion Mask */
#define SSC_TCMR_CKI(value)                   (SSC_TCMR_CKI_Msk & (_UINT32_(value) << SSC_TCMR_CKI_Pos)) /* Assignment of value for CKI in the SSC_TCMR register */
#define SSC_TCMR_CKG_Pos                      _UINT32_(6)                                          /* (SSC_TCMR) Transmit Clock Gating Selection Position */
#define SSC_TCMR_CKG_Msk                      (_UINT32_(0x3) << SSC_TCMR_CKG_Pos)                  /* (SSC_TCMR) Transmit Clock Gating Selection Mask */
#define SSC_TCMR_CKG(value)                   (SSC_TCMR_CKG_Msk & (_UINT32_(value) << SSC_TCMR_CKG_Pos)) /* Assignment of value for CKG in the SSC_TCMR register */
#define   SSC_TCMR_CKG_CONTINUOUS_Val         _UINT32_(0x0)                                        /* (SSC_TCMR) None  */
#define   SSC_TCMR_CKG_EN_TF_LOW_Val          _UINT32_(0x1)                                        /* (SSC_TCMR) Transmit Clock enabled only if TF Low  */
#define   SSC_TCMR_CKG_EN_TF_HIGH_Val         _UINT32_(0x2)                                        /* (SSC_TCMR) Transmit Clock enabled only if TF High  */
#define SSC_TCMR_CKG_CONTINUOUS               (SSC_TCMR_CKG_CONTINUOUS_Val << SSC_TCMR_CKG_Pos)    /* (SSC_TCMR) None Position */
#define SSC_TCMR_CKG_EN_TF_LOW                (SSC_TCMR_CKG_EN_TF_LOW_Val << SSC_TCMR_CKG_Pos)     /* (SSC_TCMR) Transmit Clock enabled only if TF Low Position */
#define SSC_TCMR_CKG_EN_TF_HIGH               (SSC_TCMR_CKG_EN_TF_HIGH_Val << SSC_TCMR_CKG_Pos)    /* (SSC_TCMR) Transmit Clock enabled only if TF High Position */
#define SSC_TCMR_START_Pos                    _UINT32_(8)                                          /* (SSC_TCMR) Transmit Start Selection Position */
#define SSC_TCMR_START_Msk                    (_UINT32_(0xF) << SSC_TCMR_START_Pos)                /* (SSC_TCMR) Transmit Start Selection Mask */
#define SSC_TCMR_START(value)                 (SSC_TCMR_START_Msk & (_UINT32_(value) << SSC_TCMR_START_Pos)) /* Assignment of value for START in the SSC_TCMR register */
#define   SSC_TCMR_START_CONTINUOUS_Val       _UINT32_(0x0)                                        /* (SSC_TCMR) Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data  */
#define   SSC_TCMR_START_RECEIVE_Val          _UINT32_(0x1)                                        /* (SSC_TCMR) Receive start  */
#define   SSC_TCMR_START_TF_LOW_Val           _UINT32_(0x2)                                        /* (SSC_TCMR) Detection of a low level on TF signal  */
#define   SSC_TCMR_START_TF_HIGH_Val          _UINT32_(0x3)                                        /* (SSC_TCMR) Detection of a high level on TF signal  */
#define   SSC_TCMR_START_TF_FALLING_Val       _UINT32_(0x4)                                        /* (SSC_TCMR) Detection of a falling edge on TF signal  */
#define   SSC_TCMR_START_TF_RISING_Val        _UINT32_(0x5)                                        /* (SSC_TCMR) Detection of a rising edge on TF signal  */
#define   SSC_TCMR_START_TF_LEVEL_Val         _UINT32_(0x6)                                        /* (SSC_TCMR) Detection of any level change on TF signal  */
#define   SSC_TCMR_START_TF_EDGE_Val          _UINT32_(0x7)                                        /* (SSC_TCMR) Detection of any edge on TF signal  */
#define SSC_TCMR_START_CONTINUOUS             (SSC_TCMR_START_CONTINUOUS_Val << SSC_TCMR_START_Pos) /* (SSC_TCMR) Continuous, as soon as a word is written in the SSC_THR (if Transmit is enabled), and immediately after the end of transfer of the previous data Position */
#define SSC_TCMR_START_RECEIVE                (SSC_TCMR_START_RECEIVE_Val << SSC_TCMR_START_Pos)   /* (SSC_TCMR) Receive start Position */
#define SSC_TCMR_START_TF_LOW                 (SSC_TCMR_START_TF_LOW_Val << SSC_TCMR_START_Pos)    /* (SSC_TCMR) Detection of a low level on TF signal Position */
#define SSC_TCMR_START_TF_HIGH                (SSC_TCMR_START_TF_HIGH_Val << SSC_TCMR_START_Pos)   /* (SSC_TCMR) Detection of a high level on TF signal Position */
#define SSC_TCMR_START_TF_FALLING             (SSC_TCMR_START_TF_FALLING_Val << SSC_TCMR_START_Pos) /* (SSC_TCMR) Detection of a falling edge on TF signal Position */
#define SSC_TCMR_START_TF_RISING              (SSC_TCMR_START_TF_RISING_Val << SSC_TCMR_START_Pos) /* (SSC_TCMR) Detection of a rising edge on TF signal Position */
#define SSC_TCMR_START_TF_LEVEL               (SSC_TCMR_START_TF_LEVEL_Val << SSC_TCMR_START_Pos)  /* (SSC_TCMR) Detection of any level change on TF signal Position */
#define SSC_TCMR_START_TF_EDGE                (SSC_TCMR_START_TF_EDGE_Val << SSC_TCMR_START_Pos)   /* (SSC_TCMR) Detection of any edge on TF signal Position */
#define SSC_TCMR_STTDLY_Pos                   _UINT32_(16)                                         /* (SSC_TCMR) Transmit Start Delay Position */
#define SSC_TCMR_STTDLY_Msk                   (_UINT32_(0xFF) << SSC_TCMR_STTDLY_Pos)              /* (SSC_TCMR) Transmit Start Delay Mask */
#define SSC_TCMR_STTDLY(value)                (SSC_TCMR_STTDLY_Msk & (_UINT32_(value) << SSC_TCMR_STTDLY_Pos)) /* Assignment of value for STTDLY in the SSC_TCMR register */
#define SSC_TCMR_PERIOD_Pos                   _UINT32_(24)                                         /* (SSC_TCMR) Transmit Period Divider Selection Position */
#define SSC_TCMR_PERIOD_Msk                   (_UINT32_(0xFF) << SSC_TCMR_PERIOD_Pos)              /* (SSC_TCMR) Transmit Period Divider Selection Mask */
#define SSC_TCMR_PERIOD(value)                (SSC_TCMR_PERIOD_Msk & (_UINT32_(value) << SSC_TCMR_PERIOD_Pos)) /* Assignment of value for PERIOD in the SSC_TCMR register */
#define SSC_TCMR_Msk                          _UINT32_(0xFFFF0FFF)                                 /* (SSC_TCMR) Register Mask  */


